# ГЛАВНЫЕ НАСТРОЙКИ ------------------------------------------------------------
DIMENSIONS = (700, 700)  # размеры окна в пкс
FPS = 120  # скорость симуляции

# ТЕХНИЧЕСКОЕ -----------------------------------------------------------------

# ЦВЕТА И РАЗМЕРЫ --------------------------------------------------------------
CELL_SIZE = 50
BORDER_SIZE = 1  # ширина границы клеток в пкс, деленная на 2
BG_COLOR = (100, 100, 100)
CELL_COLOR = (0, 33, 55)
CELL_BORDER_COLOR = (255, 255, 255)
ALIVE_CELL_COLOR = (255, 255, 255)
ALIVE_CELL_BORDER_COLOR = (0, 0, 0)